Dados absolutos e relativos

In [1]:
import pandas as pd

Percentuais

In [2]:
dados = {'emprego' : ['Administrador_banco_dados', 'Programador', 'Arquiteto_redes'], 'nova jersey': [97350, 82080, 112840], 'florida' : [77140, 71540, 62310]}

In [3]:
type(dados)

dict

In [5]:
dataset = pd.DataFrame(dados)
dataset

                     emprego  nova jersey  florida
0  Administrador_banco_dados        97350    77140
1                Programador        82080    71540
2            Arquiteto_redes       112840    62310

In [12]:
dataset['florida'].sum()

np.int64(210990)

In [13]:
dataset['nova jersey'].sum()

np.int64(292270)

In [22]:
dataset['%_nova_jersey'] = (dataset['nova jersey'] / dataset['nova jersey'].sum()) * 100
dataset['%_nova_jersey']

0    33.308242
1    28.083621
2    38.608136
Name: %_nova_jersey, dtype: float64

In [24]:
dataset['%_florida'] = (dataset['florida'] / dataset['florida'].sum()) * 100
dataset['%_florida']

0    36.560974
1    33.906820
2    29.532205
Name: %_florida, dtype: float64

In [25]:
dataset

                     emprego  nova jersey  florida  %_nova_jersey  %_florida
0  Administrador_banco_dados        97350    77140      33.308242  36.560974
1                Programador        82080    71540      28.083621  33.906820
2            Arquiteto_redes       112840    62310      38.608136  29.532205